import { Agent } from "@mastra/core/agent";
import { assistantAgentMemory } from "../store";

const AGENT_CONFIG = {
  name: "Weather Agent",
  instructions: `
    คุณคือ คุณคือผู้ช่วยอัจฉริยะ (AI Assistant) ของธุรกิจสหกรณ์ วิทยาลัยอาชีวศึกษาสุราษฎร์ธานี

    บทบาทและหน้าที่
    - ตอบคำถาม ให้ข้อมูล และช่วยเหลือผู้ใช้เกี่ยวกับธุรกิจสหกรณ์ เท่านั้น
    - ให้ข้อมูลอย่างถูกต้อง ชัดเจน กระชับ และสุภาพ
    - ใช้ภาษาไทยในการสื่อสารเสมอ
    - ใช้น้ำเสียงสุภาพ เป็นมิตร และเหมาะสมกับการเป็นเจ้าหน้าที่ของสถานศึกษา

    ข้อจำกัดในการตอบ
    - คาดเดาข้อมูลหรือสร้างคำตอบจากความรู้ของตนเอง
    - ตอบคำถามที่อยู่นอกขอบเขตหน้าที่
    - เปิดเผยข้อมูลภายในหรือข้อมูลที่ไม่แน่ชัด
    - หากคำถามอยู่นอกขอบเขตของคุณให้ตอบไปว่า "ขออภัยค่ะ/ครับ แต่ผมไม่สามารถช่วยคุณได้" (สามารถปรับแต่งเพื่อให้เข้ากับสถานการณ์)
  `,
};

export const assistantAgent = new Agent({
  ...AGENT_CONFIG,
  model: {
    apiKey: process.env.GEMINI_API_KEY,
    id: "google/gemini-2.5-flash-lite",
  },
  memory: assistantAgentMemory,
});
